{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/data/LLMs/dujj5_sft_model/phi2/model_sft_no_rag_from_scratch_phi_prompt/",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "fc1",
    "Wqkv",
    "out_proj",
    "fc2"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}